# Equality Operator (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCAnyHandle..::..Equality Operator
IFCAnyHandle Class See Also
---
Determines whether two IFCAnyHandles are the same.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static bool operator ==(
	IFCAnyHandle first,
	IFCAnyHandle second
)
```

Visual Basic
---
```text
Public Shared Operator = ( _
	first As IFCAnyHandle, _
	second As IFCAnyHandle _
) As Boolean
```

Visual C++
---
```text
public:
static bool operator ==(
	IFCAnyHandle^ first,
	IFCAnyHandle^ second
)
```

# ### Parameters
first
    Type: Autodesk.Revit.DB.IFC..::..IFCAnyHandleThe first IFCAnyHandle.
second
    Type: Autodesk.Revit.DB.IFC..::..IFCAnyHandleThe second IFCAnyHandle.
# ### Return Value
True if the IFCAnyHandles are the same; otherwise, false.
# See Also
IFCAnyHandle Class
Autodesk.Revit.DB.IFC Namespace